/***  p03ex10.c  ***/
/***  s12083  2J18  五味京祐  ***/

#include <stdio.h>
#include <math.h>

int main()
{
	double b,c;
	printf("b,cを入力してください >>");
	scanf("%lf,%lf",&b,&c);
	if(b*b-4*c>0){
		printf("b=%f c=%f\n",b,c);
		printf("２つの実数解：");
		printf("%f, %f\n",(-b+sqrt(b*b-4*c))/2.0,(-b-sqrt(b*b-4*c))/2.0);
	}else if(b*b-4*c==0){
		printf("b=%f c=%f\n",b,c);
		printf("重解：");
		printf("%f\n",-b/2.0);
	}else{
		printf("b=%f c=%f\n",b,c);
		printf("２つの虚数解：");
		printf("実部%f, ±虚部%f\n",-b/2.0,sqrt(-b*b+4*c)/2.0);
	}

	return 0;
}


/**************** 実行結果 *****************
b,cを入力してください >>4,3
b=4.000000 c=3.000000
２つの実数解：-1.000000, -3.000000

b,cを入力してください >>4,4
b=4.000000 c=4.000000
重解：-2.000000

b,cを入力してください >>4,5
b=4.000000 c=5.000000
２つの虚数解：実部-2.000000, ±虚部1.000000

*******************************************/
