/***  p01ex06.c  ***/
/***  s12083  2J18  ŒÜ–¡‹ž—S  ***/

#include <stdio.h>

int main()
{
	int a,b;
	scanf("%d %d",&a,&b);
	printf("2”‚ð“ü—Í--> %d %d\n",a,b);
	printf("%d+%d=%d\n",a,b,a+b);
	printf("%d-%d=%d\n",a,b,a-b);
	printf("%d*%d=%d\n",a,b,a*b);
	printf("%d/%d=%d\n",a,b,a/b);
	printf("%d%%%d=%d\n",a,b,a%b);
	
	return 0;
}


/**************** ŽÀsŒ‹‰Ê *****************
12 5
2”‚ð“ü—Í--> 12 5
12+5=17
12-5=7
12*5=60
12/5=2
12%5=2

17 7
2”‚ð“ü—Í--> 17 7
17+7=24
17-7=10
17*7=119
17/7=2
17%7=3

*******************************************/
