/***  p02ex17.c  ***/
/***  s12083  2J18  五味京祐  ***/

#include <stdio.h>

int main()
{
	int p,q,r;
	scanf("%d %d",&p,&q);
	r=p%q;
	printf("p%%q=r  %d%%%d=%d\n",p,q,r); /*途中経過を表示するため*/
	while (r!=0) {
		p=q;
		q=r;
		r=p%q;
		printf("p%%q=r  %d%%%d=%d\n",p,q,r); /*途中経過を表示するため*/
	}

	printf("%d\n",q);

	return 0;
}


/**************** 実行結果 *****************
72 42
p%q=r  72%42=30
p%q=r  42%30=12
p%q=r  30%12=6
p%q=r  12%6=0
6

42 72
p%q=r  42%72=42
p%q=r  72%42=30
p%q=r  42%30=12
p%q=r  30%12=6
p%q=r  12%6=0
6

256 72
p%q=r  256%72=40
p%q=r  72%40=32
p%q=r  40%32=8
p%q=r  32%8=0
8

72 256
p%q=r  72%256=72
p%q=r  256%72=40
p%q=r  72%40=32
p%q=r  40%32=8
p%q=r  32%8=0
8
*******************************************/
